app/Http/Controllers/LaporanPenilaianController.php

select * from `nilai_peserta` limit 10 offset 0
select * from `peserta` where `peserta`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select count(*) as aggregate from `nilai_peserta`
---
    public function index()
    {
        $data_nilai = Nilai_Peserta::with('peserta')->paginate(10);

select * from `peserta` where `id` = '1' limit 1
---
    public function show($id)
    {
        try {
            $laporan_penilaian = Peserta::where('id', $id)->with('nilai')->first();