app/Http/Controllers/PesertaController.php

    public function edit($id)
    {
        $data_peserta = Peserta::with('nilai')->where('id', $id)->first();
---
select * from `peserta` where `id` = '101' limit 1

    public function update(Request $request, $id)
    {
        try {
            // Ambil data pengguna berdasarkan ID
            $peserta = Peserta::find($id);
---
select * from `peserta` where `peserta`.`id` = '1' limit 1

            $peserta->save();

            // Update nilai peserta
            Nilai_Peserta::where('id_peserta', $peserta->id)
                ->update([
                    'nilai_x' => $request->input('nilai_x'),
                    'nilai_y' => $request->input('nilai_y'),
                    'nilai_y' => $request->input('nilai_y'),
                    'nilai_z' => $request->input('nilai_z'),
                    'nilai_w' => $request->input('nilai_w'),
                    'id_peserta' => $peserta->id
                ]);
---
update `nilai_peserta` set `nilai_x` = '13', `nilai_y` = '13', `nilai_z` = '13', `nilai_w` = '13', `id_peserta` = 1, `nilai_peserta`.`updated_at` = '2023-05-15 08:49:52' where `id_peserta` = 1